sbela/mkv58-boot/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_I2C_Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_I2C_Pins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    /* PORTB2 (pin 83) is configured as I2C0_SCL */
    PORT_SetPinMux(BOARD_I2C_PINS_I2C_SCL_PORT, BOARD_I2C_PINS_I2C_SCL_PIN, kPORT_MuxAlt2);

    PORTB->PCR[2] = ((PORTB->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTB3 (pin 84) is configured as I2C0_SDA */
    PORT_SetPinMux(BOARD_I2C_PINS_I2C_SDA_PORT, BOARD_I2C_PINS_I2C_SDA_PIN, kPORT_MuxAlt2);

    PORTB->PCR[3] = ((PORTB->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_JTAG:
- options: {callFromInitBoot: 'true', prefix: BOARD_JTAG_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '50', peripheral: JTAG, signal: JTAG_TCLK_SWD_CLK, pin_signal: PTA0/UART0_CTS_b/UART0_COL_b/FTM0_CH5/XB_IN4/EWM_IN/JTAG_TCLK/SWD_CLK}
  - {pin_num: '51', peripheral: JTAG, signal: TDI, pin_signal: PTA1/UART0_RX/FTM0_CH6/CMP0_OUT/FTM2_QD_PHA/FTM1_CH1/JTAG_TDI}
  - {pin_num: '52', peripheral: JTAG, signal: TDO, pin_signal: PTA2/UART0_TX/FTM0_CH7/CMP1_OUT/FTM2_QD_PHB/FTM1_CH0/JTAG_TDO/TRACE_SWO}
  - {pin_num: '53', peripheral: JTAG, signal: JTAG_TMS_SWD_DIO, pin_signal: PTA3/UART0_RTS_b/FTM0_CH0/XB_IN9/EWM_OUT_b/FLEXPWM0_A0/JTAG_TMS/SWD_DIO}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_JTAG
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_JTAG(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA0 (pin 50) is configured as JTAG_TCLK */
    PORT_SetPinMux(PORTA, 0U, kPORT_MuxAlt7);

    /* PORTA1 (pin 51) is configured as JTAG_TDI */
    PORT_SetPinMux(PORTA, 1U, kPORT_MuxAlt7);

    /* PORTA2 (pin 52) is configured as JTAG_TDO */
    PORT_SetPinMux(PORTA, 2U, kPORT_MuxAlt7);

    /* PORTA3 (pin 53) is configured as JTAG_TMS */
    PORT_SetPinMux(PORTA, 3U, kPORT_MuxAlt7);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_POWER_Pins:
- options: {callFromInitBoot: 'true', prefix: BOARD_POWER_PINS_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '71', peripheral: PMC, signal: 'VSS, 72', pin_signal: VSS71}
  - {pin_num: '70', peripheral: PMC, signal: 'VDD, 71', pin_signal: VDD70}
  - {pin_num: '57', peripheral: PMC, signal: 'VSS, 58', pin_signal: VSS57}
  - {pin_num: '56', peripheral: PMC, signal: 'VDD, 57', pin_signal: VDD56}
  - {pin_num: '44', peripheral: PMC, signal: 'VSS, 45', pin_signal: VSS44}
  - {pin_num: '43', peripheral: PMC, signal: 'VDD, 44', pin_signal: VDD43}
  - {pin_num: '17', peripheral: PMC, signal: 'VSS, 17', pin_signal: VSS17}
  - {pin_num: '16', peripheral: PMC, signal: 'VDD, 16', pin_signal: VDD16}
  - {pin_num: '6', peripheral: PMC, signal: 'VSS, 6', pin_signal: VSS6}
  - {pin_num: '5', peripheral: PMC, signal: 'VDD, 5', pin_signal: VDD5}
  - {pin_num: '93', peripheral: PMC, signal: 'VSS, 94', pin_signal: VSS93}
  - {pin_num: '94', peripheral: PMC, signal: 'VDD, 95', pin_signal: VDD94}
  - {pin_num: '107', peripheral: PMC, signal: 'VSS, 108', pin_signal: VSS107}
  - {pin_num: '108', peripheral: PMC, signal: 'VDD, 109', pin_signal: VDD108}
  - {pin_num: '134', peripheral: PMC, signal: 'VSS, 135', pin_signal: VSS134}
  - {pin_num: '135', peripheral: PMC, signal: 'VDD, 136', pin_signal: VDD135}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_POWER_Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_POWER_Pins(void)
{
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
